# Rolling a die.
# ==============================================================================
# 주사위 백만번 굴려보기.
# ==============================================================================
# for i in [1:1e+06...] 
#     print(rand(1:6))
# end

# probability of quincunx.
# ==============================================================================
# 1. 일단, 확률을 계산하기 위해서 백만번 굴려 나오는 눈을 리스트로 뽑는다. 
# ==============================================================================
function D()
    L = zeros(1e+06) # 값이 모두 0인 백만개의 elements를 갖는 리스트
    for i=1:Int(1e+06)
        L[i] = rand(1:6) # 각 리스트의 원소를 1~6까지 random한 값을 갖도록 설정.
    end
    return L
end

function P(List)
    count = 0
    for j in List
        if j == 5
            count += 1
        end
    end
    return count / length(List) # length()가 전체 갯수
end

A = D() # function D의 리스트 안의 원소를 A로 뽑아내기.
println(P(A))
